# St7SetPlateHeatSource1

Sets the heat source for the specified plate.

long St7SetPlateHeatSource1(long uID, long PlateNum, long CaseNum,
double* Doubles)
Input Parameters
uID
Strand7 model file ID.
PlateNum
Plate number.
CaseNum
Load case number.
Doubles[0]
Heat source.